<?php

return [
    'capitalfirst' => [
        'login' => 'Логин должен начинаться с заглавной латинской буквы.'
    ],
    'confirmed' => [
        'password' => 'Подтверждение не совпадает с паролем.'
    ],
    'email' => 'Неверный формат электронной почты.',
    'failedlogin' => 'Неверный логин или пароль.',
    'max' => [
        'login' => 'Логин должен содержать не более :max символов.'
    ],
    'min' => [
        'login' => 'Логин должен содержать не менее :min символов.',
        'password' => 'Пароль должен содержать не менее :min символов.'
    ],
    'mixed' => [
        'password' => 'Пароль должен содержать хотя бы одну строчную и хотя бы одну заглавную латинскую букву.'
    ],
    'numbers' => [
        'password' => 'Пароль должен содержать хотя бы одно число.'
    ],
    'required' => [
        'login' => 'Логин не должен быть пустым.',
        'email' => 'Поле электронной почты должно быть заполнено.',
        'password' => 'Пароль не должен быть пустым.'
    ],
    'unique' => [
        'login' => 'Данный логин уже существует.',
        'email' => 'Данная электронная почта уже используется.'
    ],
    'word' => [
        'login' => 'Логин должен состоять из латинских букв или чисел.'
    ]
];
