<?php

return [
    /**
     * Данные строки соответствуют причинам, указанным брокером паролей при неудачной попытке обновления пароля,
     * например, из-за недопустимого токена или недопустимого нового пароля.
     */
    'reset' => 'Ваш пароль был сброшен.',
    'sent' => 'Мы отправили ссылку для сброса пароля по электронной почте.',
    'throttled' => 'Подождите, прежде чем повторить попытку.',
    'token' => 'Этот токен сброса пароля недействителен.',
    'user' => 'Мы не можем найти пользователя с таким адресом электронной почты.',
];
